---
kind: method
id: M:Autodesk.Revit.DB.Document.SetUnits(Autodesk.Revit.DB.Units)
zh: 文档、文件
source: html/44eccb2b-65c6-a6d7-f6ac-07017fc12332.htm
---
# Autodesk.Revit.DB.Document.SetUnits Method

**中文**: 文档、文件

Sets the units.

## Syntax (C#)
```csharp
public void SetUnits(
	Units units
)
```

## Parameters
- **units** (`Autodesk.Revit.DB.Units`) - The units.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null